examples/08_k3.0_gravity/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

// HFDIBDEMFoam reads this dictionary but does not solve the fluid equations.
transportModel Newtonian;
nu             nu  [0 2 -1 0 0 0 0] 1e-6;
rho            rho [1 -3 0 0 0 0 0] 1000;

// ************************************************************************* //

