examples/08_k3.0_gravity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.01;

vertices
(
    // 10 mm x 10 mm downstream throat, y = 0--25 mm.
    (-0.5 0   -0.5) // 0
    ( 0.5 0   -0.5) // 1
    ( 0.5 2.5 -0.5) // 2
    (-0.5 2.5 -0.5) // 3

    (-0.5 0    0.5) // 4
    ( 0.5 0    0.5) // 5
    ( 0.5 2.5  0.5) // 6
    (-0.5 2.5  0.5) // 7

    // Reservoir bottom at y = 25 mm.
    (-2.0 2.5 -2.0) // 8
    (-0.5 2.5 -2.0) // 9
    ( 0.5 2.5 -2.0) // 10
    ( 2.0 2.5 -2.0) // 11

    (-2.0 2.5 -0.5) // 12
    ( 2.0 2.5 -0.5) // 13

    (-2.0 2.5  0.5) // 14
    ( 2.0 2.5  0.5) // 15

    (-2.0 2.5  2.0) // 16
    (-0.5 2.5  2.0) // 17
    ( 0.5 2.5  2.0) // 18
    ( 2.0 2.5  2.0) // 19

    // Reservoir top at y = 75 mm.
    (-2.0 7.5 -2.0) // 20
    (-0.5 7.5 -2.0) // 21
    ( 0.5 7.5 -2.0) // 22
    ( 2.0 7.5 -2.0) // 23

    (-2.0 7.5 -0.5) // 24
    (-0.5 7.5 -0.5) // 25
    ( 0.5 7.5 -0.5) // 26
    ( 2.0 7.5 -0.5) // 27

    (-2.0 7.5  0.5) // 28
    (-0.5 7.5  0.5) // 29
    ( 0.5 7.5  0.5) // 30
    ( 2.0 7.5  0.5) // 31

    (-2.0 7.5  2.0) // 32
    (-0.5 7.5  2.0) // 33
    ( 0.5 7.5  2.0) // 34
    ( 2.0 7.5  2.0) // 35
);

blocks
(
    // Throat: 10 x 25 x 10 = 2,500 cells.
    hex (0 1 2 3 4 5 6 7)
        (10 25 10) simpleGrading (1 1 1)

    // Reservoir: (15 + 10 + 15) x 50 x (15 + 10 + 15)
    // = 80,000 cells.
    hex (8 9 21 20 12 3 25 24)
        (15 50 15) simpleGrading (1 1 1)
    hex (9 10 22 21 3 2 26 25)
        (10 50 15) simpleGrading (1 1 1)
    hex (10 11 23 22 2 13 27 26)
        (15 50 15) simpleGrading (1 1 1)

    hex (12 3 25 24 14 7 29 28)
        (15 50 10) simpleGrading (1 1 1)
    hex (3 2 26 25 7 6 30 29)
        (10 50 10) simpleGrading (1 1 1)
    hex (2 13 27 26 6 15 31 30)
        (15 50 10) simpleGrading (1 1 1)

    hex (14 7 29 28 16 17 33 32)
        (15 50 15) simpleGrading (1 1 1)
    hex (7 6 30 29 17 18 34 33)
        (10 50 15) simpleGrading (1 1 1)
    hex (6 15 31 30 18 19 35 34)
        (15 50 15) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottomOutlet
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }

    topOpen
    {
        type patch;
        faces
        (
            (21 20 24 25)
            (22 21 25 26)
            (23 22 26 27)

            (25 24 28 29)
            (26 25 29 30)
            (27 26 30 31)

            (29 28 32 33)
            (30 29 33 34)
            (31 30 34 35)
        );
    }

    contractionWall
    {
        type wall;
        faces
        (
            (9 3 12 8)
            (10 2 3 9)
            (11 13 2 10)

            (3 7 14 12)
            (13 15 6 2)

            (7 17 16 14)
            (6 18 17 7)
            (15 19 18 6)
        );
    }

    xMinWall
    {
        type wall;
        faces
        (
            (0 4 7 3)

            (8 12 24 20)
            (12 14 28 24)
            (14 16 32 28)
        );
    }

    xMaxWall
    {
        type wall;
        faces
        (
            (2 6 5 1)

            (23 27 13 11)
            (27 31 15 13)
            (31 35 19 15)
        );
    }

    zMinWall
    {
        type wall;
        faces
        (
            (0 3 2 1)

            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
        );
    }

    zMaxWall
    {
        type wall;
        faces
        (
            (4 5 6 7)

            (16 17 33 32)
            (17 18 34 33)
            (18 19 35 34)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //

