examples/08_k3.0_gravity/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default    Gauss linear;
    grad(body) linear;
}

divSchemes
{
    default                         Gauss linear;
    div(phi,U)                      Gauss linear grad(U);
    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
    div(((lambda*(1|A(U)))*f))      Gauss linear;
}

laplacianSchemes
{
    default Gauss linear limited corrected 0.5;
}

interpolationSchemes
{
    default linear;
}

snGradSchemes
{
    default limited corrected 0.5;
}

// ************************************************************************* //

